llm/hunyuan3_preview/b200/bench/bench_sharegpt_low.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', model='tencent/Hy3-preview', served_model_name=None, tokenizer=None, num_prompts=10, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='/data/bbuf/kda-pilot/llm/hunyuan3_preview/b200/bench/sharegpt_low.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=10, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/data/bbuf/kda-pilot/llm/hunyuan3_preview/b200/profile/sharegpt_low', profile_prefix='sharegpt_low', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', model='tencent/Hy3-preview', served_model_name=None, tokenizer=None, num_prompts=10, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='/data/bbuf/kda-pilot/llm/hunyuan3_preview/b200/bench/sharegpt_low.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=10, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/data/bbuf/kda-pilot/llm/hunyuan3_preview/b200/profile/sharegpt_low', profile_prefix='sharegpt_low', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 1964
#Output tokens: 2791
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Starting profiler...
async_request_profile api_url='http://127.0.0.1:30000/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None, 'output_dir': '/data/bbuf/kda-pilot/llm/hunyuan3_preview/b200/profile/sharegpt_low/1781867780.3569636', 'profile_prefix': 'sharegpt_low'}
Profiler started

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     10        
Benchmark duration (s):                  19.20     
Total input tokens:                      1964      
Total input text tokens:                 1964      
Total generated tokens:                  2791      
Total generated tokens (retokenized):    2769      
Request throughput (req/s):              0.52      
Input token throughput (tok/s):          102.31    
Output token throughput (tok/s):         145.39    
Peak output token throughput (tok/s):    200.00    
Peak concurrent requests:                3         
Total token throughput (tok/s):          247.69    
Concurrency:                             1.00      
Accept length:                           3.03      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1918.37   
Median E2E Latency (ms):                 2081.63   
P90 E2E Latency (ms):                    3215.79   
P99 E2E Latency (ms):                    3481.82   
---------------Time to First Token----------------
Mean TTFT (ms):                          139.44    
Median TTFT (ms):                        127.96    
P99 TTFT (ms):                           189.34    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.55      
Median TPOT (ms):                        6.13      
P99 TPOT (ms):                           11.60     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           6.40      
Median ITL (ms):                         4.47      
P95 ITL (ms):                            13.29     
P99 ITL (ms):                            14.13     
Max ITL (ms):                            402.71    
==================================================